Enums/ВидыПоследовательности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПоследовательности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПартииТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаиморасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииОрганизаций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ТК_ЗаявкаНаПеремещение</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваровТМП</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ПриходованиеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадкаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпанииПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокНомер</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокДата</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаОтгрузки</Name>
					<Comment>ID документа отгрузки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БратьСтоимостьИзДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ТК_ЗаявкаНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерRB</Name>
					<Comment>Номер Open Store</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусRB</Name>
					<Comment>Статус выгрузки в Open Store</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыгрузкиRB</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеЗаказовПокупателей</Name>
					<Comment> 0 - Ручное распределение, 1 - Закрывать (по-умолчанию), 2 - Не закрывать</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазовое</Name>
							<Comment>Количество номенклатуры в базовых единицах (коэффициент=1)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеОтгрузки</Name>
					<Comment>Распределение отгрузки по заказам покупателей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/УправлениеПоследовательностями/Ext/Module.bsl
Процедура ЗарегистрироватьДокументВПоследовательностях(ДополнительныеСвойства,ПринадлежностьПоследовательностям,Отказ) Экспорт
	
	Если Отказ ИЛИ ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Последовательность Из ПринадлежностьПоследовательностям Цикл 
		Если Последовательность.Количество() > 0 Тогда
			Последовательность.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	ИзменениеПоследовательностиПартииТоваров = Истина;
	Если ДополнительныеСвойства.Свойство("ДвиженияПартииТоваровИзменение") Тогда
		 ИзменениеПоследовательностиПартииТоваров = ДополнительныеСвойства.ДвиженияПартииТоваровИзменение;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ТаблицыДляПоследовательности.Свойство("ПартииТоваров") И ИзменениеПоследовательностиПартииТоваров Тогда
		Таблица =  ДополнительныеСвойства.ТаблицыДляПоследовательности.ПартииТоваров;
		ПринадлежностьПоследовательностям.ПартииТоваров.Загрузить(Таблица);
		
		Для Каждого ЗаписьПоследовательности Из Таблица Цикл 
			 СтрурктураОтбораСклад = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",ЗаписьПоследовательности.СкладКомпании,Ложь);
			 ПроверитьЗаписатьПоследовательностьДокумента(ЗаписьПоследовательности.Период, ДополнительныеСвойства.ДляПроведения.Момент, СтрурктураОтбораСклад);
		КонецЦикла;
		
		Если ДополнительныеСвойства.Свойство("СкладКомпанииИзменен") И ДополнительныеСвойства.СкладКомпанииИзменен Тогда
			 СтрурктураОтбораСклад = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",ДополнительныеСвойства.СтарыйСкладДокумента,Ложь);
			 ПроверитьЗаписатьПоследовательностьДокумента(ДополнительныеСвойства.ДляПроведения.Дата ,Новый МоментВремени(ДополнительныеСвойства.ДляПроведения.Дата),СтрурктураОтбораСклад);
		КонецЕсли;
		
		//Проверка документа перемещения склад получатель
		Если ДополнительныеСвойства.Свойство("СкладКомпанииПолучательИзменен") И ДополнительныеСвойства.СкладКомпанииПолучательИзменен Тогда
			 СтрурктураОтбораСклад = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",ДополнительныеСвойства.СкладКомпанииПолучательИзменен,Ложь);
			 ПроверитьЗаписатьПоследовательностьДокумента(ДополнительныеСвойства.ДляПроведения.Дата ,Новый МоментВремени(ДополнительныеСвойства.ДляПроведения.Дата),СтрурктураОтбораСклад);
		КонецЕсли;
		                           		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ТаблицыДляПоследовательности.Свойство("Взаиморасчеты") Тогда
		Таблица =  ДополнительныеСвойства.ТаблицыДляПоследовательности.Взаиморасчеты;
		ПринадлежностьПоследовательностям.Взаиморасчеты.Загрузить(Таблица);
		
		Для Каждого ЗаписьПоследовательности Из Таблица Цикл 

			СтрурктураОтбора = Новый Структура("ДоговорКонтрагента,ПроведенВХронологическойПоследовательности",ЗаписьПоследовательности.ДоговорКонтрагента,Ложь);
			ПроверитьЗаписатьПоследовательностьВзаиморасчетовДокумента(ЗаписьПоследовательности.Период, ДополнительныеСвойства.ДляПроведения.Момент, СтрурктураОтбора);
			
		КонецЦикла;
			
		Если ДополнительныеСвойства.Свойство("ДоговорВзаиморасчетовИзменен") И ДополнительныеСвойства.ДоговорВзаиморасчетовИзменен Тогда
			 СтрурктураОтбора = Новый Структура("ДоговорКонтрагента,ПроведенВХронологическойПоследовательности",ДополнительныеСвойства.СтарыйДоговорДокумента,Ложь);
			 ПроверитьЗаписатьПоследовательностьВзаиморасчетовДокумента(ДополнительныеСвойства.ДляПроведения.Дата, Новый МоментВремени(ДополнительныеСвойства.ДляПроведения.Дата),СтрурктураОтбора);
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ТаблицаДоговоровПроверкиПоследовательности") Тогда
			Для Каждого ЗаписьДоговорПоследовательности Из ДополнительныеСвойства.ТаблицаДоговоровПроверкиПоследовательности Цикл
				СтрокаТаблицы = Таблица.Найти(ЗаписьДоговорПоследовательности.ДоговорКонтрагента,"ДоговорКонтрагента");
				Если СтрокаТаблицы = Неопределено Тогда
					СтрурктураОтбора = Новый Структура("ДоговорКонтрагента,ПроведенВХронологическойПоследовательности",ЗаписьДоговорПоследовательности.ДоговорКонтрагента,Ложь);
					ПроверитьЗаписатьПоследовательностьВзаиморасчетовДокумента(ДополнительныеСвойства.ДляПроведения.Дата, Новый МоментВремени(ДополнительныеСвойства.ДляПроведения.Дата),СтрурктураОтбора);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

	Если ДополнительныеСвойства.ТаблицыДляПоследовательности.Свойство("ПартииОрганизаций") И ДополнительныеСвойства.ДляПроведения.Свойство("РегистрацияПоследовательности")
		И ДополнительныеСвойства.ДляПроведения.РегистрацияПоследовательности Тогда
		Таблица =  ДополнительныеСвойства.ТаблицыДляПоследовательности.ПартииОрганизаций;
		ПринадлежностьПоследовательностям.ПартииОрганизаций.Загрузить(Таблица);
		
		Для Каждого ЗаписьПоследовательности Из Таблица Цикл 
			
			СтрурктураОтбора = Новый Структура("Организация,ПроведенВХронологическойПоследовательности",ЗаписьПоследовательности.Организация,Ложь);
			ПроверитьЗаписатьПоследовательностьПартииОрганизаций(ЗаписьПоследовательности.Период, ДополнительныеСвойства.ДляПроведения.Момент, СтрурктураОтбора);
			
		КонецЦикла;
		
		Если ДополнительныеСвойства.Свойство("ОрганизацияИзменена") И ДополнительныеСвойства.ОрганизацияИзменена Тогда
			СтрурктураОтбора = Новый Структура("Организация,ПроведенВХронологическойПоследовательности",ДополнительныеСвойства.СтараяОрганизацияДокумента,Ложь);
			ПроверитьЗаписатьПоследовательностьПартииОрганизаций(ДополнительныеСвойства.ДляПроведения.Дата, Новый МоментВремени(ДополнительныеСвойства.ДляПроведения.Дата),СтрурктураОтбора);
		КонецЕсли;
		
		
	КонецЕсли;

	
КонецПроцедуры



Процедура ЗарегистрироватьВХронологическойПоследовательности(Последовательность,ДокументСсылка,Склад,МассивСкладовПолучателей)Экспорт
	
	НаборЗаписей = Последовательности[Последовательность].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	НеобходимоЗаписать = Ложь;
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл 
		Если ЗаписьНабора.СкладКомпании = Склад И Не ЗаписьНабора.ПроведенВХронологическойПоследовательности Тогда
			ЗаписьНабора.ПроведенВХронологическойПоследовательности = Истина;
			НеобходимоЗаписать = Истина;
		Иначе
			Для каждого СкладПолучателя Из МассивСкладовПолучателей Цикл
				Если ЗаписьНабора.СкладКомпании = СкладПолучателя И НЕ ЗаписьНабора.ПроведенВХронологическойПоследовательности = Ложь Тогда
					ЗаписьНабора.ПроведенВХронологическойПоследовательности = Ложь;
					НеобходимоЗаписать = Истина;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	
	Если НеобходимоЗаписать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьВХронологическойПоследовательностиВзаиморасчеты(ДокументСсылка,ДоговорКонтрагента)Экспорт
	
	НаборЗаписей = Последовательности.Взаиморасчеты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	НеобходимоЗаписать = Ложь;
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл 
		Если  Не ЗаписьНабора.ПроведенВХронологическойПоследовательности Тогда
			ЗаписьНабора.ПроведенВХронологическойПоследовательности = Истина;
			НеобходимоЗаписать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НеобходимоЗаписать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьВХронологическойПоследовательностиПартииОрганизации(ДокументСсылка,Организация)Экспорт
	
	НаборЗаписей = Последовательности.ПартииОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	НеобходимоЗаписать = Ложь;
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл 
		Если  Не ЗаписьНабора.ПроведенВХронологическойПоследовательности Тогда
			ЗаписьНабора.ПроведенВХронологическойПоследовательности = Истина;
			НеобходимоЗаписать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НеобходимоЗаписать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры






Процедура ПроверитьУстановитьПоследовательностьВходящегоДокумента(Последовательность,ДокументСсылка,ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.МоментВремени КАК МоментВремени,
		|	ПеремещениеТоваров.Ссылка КАК Ссылка,
		|	ПеремещениеТоваров.СкладКомпанииПолучатель КАК СкладКомпанииПолучатель,
		|	ПеремещениеТоваров.ДокументОтгрузки.Дата КАК ДокументОтгрузкиДата,
		|	ПеремещениеТоваров.Дата КАК Дата
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.ДокументОтгрузки = &ДокументОтгрузки
		|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)";
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Такие документы не регистрируем 
		Если ВыборкаДетальныеЗаписи.ДокументОтгрузкиДата > ВыборкаДетальныеЗаписи.Дата Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписейПоследовательности = Последовательности.ПартииТоваров.СоздатьНаборЗаписей();
		НаборЗаписейПоследовательности.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписейПоследовательности.Прочитать();
        НеобходимоЗаписать = Ложь;
		Для Каждого ЗаписьНабора Из  НаборЗаписейПоследовательности Цикл 
			Если ЗаписьНабора.ПроведенВХронологическойПоследовательности Тогда
				ЗаписьНабора.ПроведенВХронологическойПоследовательности = Ложь;
				НеобходимоЗаписать = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НеобходимоЗаписать Тогда
			НаборЗаписейПоследовательности.Записать();
		КонецЕсли;
		
		СтрурктураОтбораСклад = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",ВыборкаДетальныеЗаписи.СкладКомпанииПолучатель,Ложь);
		ПроверитьЗаписатьПоследовательностьДокумента(ВыборкаДетальныеЗаписи.Дата,ВыборкаДетальныеЗаписи.МоментВремени,СтрурктураОтбораСклад);
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ПроверитьЗаписатьПоследовательностьДокумента(ДатаДокумента,НаМоментВремени,СтрурктураОтбораСклад);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартииТоваровГраницы.Период КАК Период
	|ИЗ
	|	Последовательность.ПартииТоваров.Границы КАК ПартииТоваровГраницы
	|ГДЕ
	|	ПартииТоваровГраницы.СкладКомпании = &СкладКомпании";
	
	Запрос.УстановитьПараметр("СкладКомпании", СтрурктураОтбораСклад.СкладКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Следующий();
	ПериодПоследовательности = ВыборкаДетальныеЗаписи.Период;
	
	Если ПериодПоследовательности>ДатаДокумента Тогда
		Последовательности.ПартииТоваров.УстановитьГраницу(НаМоментВремени,СтрурктураОтбораСклад);
 	КонецЕсли;
	

	
КонецПроцедуры

Процедура ПроверитьЗаписатьПоследовательностьВзаиморасчетовДокумента(ДатаДокумента,НаМоментВремени,СтрурктураОтбора);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыГраницы.Период КАК Период
	|ИЗ
	|	Последовательность.Взаиморасчеты.Границы КАК ВзаиморасчетыГраницы
	|ГДЕ
	|	ВзаиморасчетыГраницы.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", СтрурктураОтбора.ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Следующий();
	ПериодПоследовательности = ВыборкаДетальныеЗаписи.Период;
	
	Если ПериодПоследовательности>ДатаДокумента Тогда
		Последовательности.Взаиморасчеты.УстановитьГраницу(НаМоментВремени,СтрурктураОтбора);
 	КонецЕсли;
	

	
КонецПроцедуры

Процедура ПроверитьЗаписатьПоследовательностьПартииОрганизаций(ДатаДокумента,НаМоментВремени,СтрурктураОтбора);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартииОрганизаций.Период КАК Период
	|ИЗ
	|	Последовательность.ПартииОрганизаций.Границы КАК ПартииОрганизаций
	|ГДЕ
	|	ПартииОрганизаций.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", СтрурктураОтбора.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Следующий();
	ПериодПоследовательности = ВыборкаДетальныеЗаписи.Период;
	
	Если ПериодПоследовательности>ДатаДокумента Тогда
		Последовательности.ПартииОрганизаций.УстановитьГраницу(НаМоментВремени,СтрурктураОтбора);
 	КонецЕсли;
	

	
КонецПроцедуры


Процедура ОтменаПроведенияРегистрацияВПоследовательностиПартииТоваров(Источник, Отказ) Экспорт
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипИсточника = ТипЗнч(Источник);
	
	МоментВремени =  Новый МоментВремени(Источник.Дата,Источник.Ссылка);
	
	
	Если Источник.ПринадлежностьПоследовательностям.Найти("ПартииТоваров")<> Неопределено Тогда
	
		СтрурктураОтбораСклад = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",Источник.СкладКомпании,Ложь);
		
		Если Последовательности.ПартииТоваров.Проверить(МоментВремени,СтрурктураОтбораСклад)Тогда
			Последовательности.ПартииТоваров.УстановитьГраницу(МоментВремени,СтрурктураОтбораСклад)
		КонецЕсли;
		
		Если ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") И  Источник.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда 
			СтрурктураОтбораСклад.Вставить("СкладКомпании",Источник.СкладКомпанииПолучатель);
			
			Если Последовательности.ПартииТоваров.Проверить(МоментВремени,СтрурктураОтбораСклад)Тогда
				Последовательности.ПартииТоваров.УстановитьГраницу(МоментВремени,СтрурктураОтбораСклад)
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.ПринадлежностьПоследовательностям.Найти("Взаиморасчеты")<> Неопределено Тогда
	
		СтрурктураОтбора = Новый Структура("ДоговорКонтрагента,ПроведенВХронологическойПоследовательности",Источник.ДоговорВзаиморасчетов,Ложь);
		
		Если Последовательности.Взаиморасчеты.Проверить(МоментВремени,СтрурктураОтбора)Тогда
			Последовательности.Взаиморасчеты.УстановитьГраницу(МоментВремени,СтрурктураОтбора)
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	Если Источник.ПринадлежностьПоследовательностям.Найти("ПартииОрганизаций")<> Неопределено И ПроведениеСервер.ИспользуютсяОстаткиОрганизаций(Источник.Дата)Тогда
		СтрурктураОтбораОрганизация = Новый Структура("Организация,ПроведенВХронологическойПоследовательности",,Ложь);
		
		Если ТипИсточника = Тип("ДокументОбъект.ПоступлениеТоваров") И Источник.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровТранзиты И ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) Тогда
			СтрурктураОтбораОрганизация.Вставить("Организация",Источник.ДоговорВзаиморасчетов.Организация);
		ИначеЕсли  ТипИсточника = Тип("ДокументОбъект.ВозвратПоставщику") И Источник.ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщикуТранзиты И ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) Тогда
			СтрурктураОтбораОрганизация.Вставить("Организация",Источник.ДоговорВзаиморасчетов.Организация);
		Иначе
			СтрурктураОтбораОрганизация.Вставить("Организация",Источник.Организация);
		КонецЕсли;
		
		Если Последовательности.ПартииОрганизаций.Проверить(МоментВремени,СтрурктураОтбораОрганизация)Тогда
			Последовательности.ПартииОрганизаций.УстановитьГраницу(МоментВремени,СтрурктураОтбораОрганизация)
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ИмяПоследовательности(ВидПоследовательности)Экспорт
	СтруктураПоследовательности = Новый Структура("стрГраница,стрОтборГраницы");
	Если ВидПоследовательности = Перечисления.ВидыПоследовательности.ПартииТоваров Тогда
		СтруктураПоследовательности.стрГраница ="ПартииТоваров";
		СтруктураПоследовательности.стрОтборГраницы ="СкладКомпании";
	ИначеЕсли ВидПоследовательности = Перечисления.ВидыПоследовательности.ПартииОрганизаций Тогда
		СтруктураПоследовательности.стрГраница = "ПартииОрганизаций";
		СтруктураПоследовательности.стрОтборГраницы ="Организация";
	ИначеЕсли ВидПоследовательности = Перечисления.ВидыПоследовательности.Взаиморасчеты Тогда
		СтруктураПоследовательности.стрГраница ="Взаиморасчеты";
		СтруктураПоследовательности.стрОтборГраницы ="ДоговорКонтрагента";
	КонецЕсли;
	
	Возврат СтруктураПоследовательности;
	
КонецФункции


Функция ПолучитьГраницуПоследовательности(ВидПоследовательности,ПарамОтбор)Экспорт
	
	СтруктураПоследовательности = ИмяПоследовательности(ВидПоследовательности);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПД.МоментВремени КАК МоментВремени
	|ИЗ
	|	Последовательность."+СтруктураПоследовательности.стрГраница+" КАК ПД
	|ГДЕ
	|	НЕ ПД.ПроведенВХронологическойПоследовательности
	|	И ПД."+СтруктураПоследовательности.стрОтборГраницы+" = &Отбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	Запрос.УстановитьПараметр("Отбор",ПарамОтбор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.МоментВремени;
	Иначе
		Возврат Новый МоментВремени('00010101');
	КонецЕсли;
	
КонецФункции


Процедура ЗаполнитьИзмерениеПроведенВХронологическойПоследовательности(ВидПоследовательности,Дата,ПарамОтбор)Экспорт
	
	СтруктураПоследовательности = ИмяПоследовательности(ВидПоследовательности);
	
	Если ЗначениеЗаполнено(ПарамОтбор) Тогда
		УсловиеОтбора = " И ПД."+СтруктураПоследовательности.стрОтборГраницы+" = &ПарамОтбор";
	Иначе
		УсловиеОтбора = "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПД.Регистратор КАК Регистратор
		|ИЗ
		|	Последовательность."+СтруктураПоследовательности.стрГраница+" КАК ПД
		|ГДЕ
		|	ПД.Период < &Дата
		|	И НЕ ПД.ПроведенВХронологическойПоследовательности"+ УсловиеОтбора;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПарамОтбор", ПарамОтбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = Последовательности[СтруктураПоследовательности.стрГраница].СоздатьНаборЗаписей();

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл

			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
				ТекущаяЗапись.ПроведенВХронологическойПоследовательности = Истина;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПарамОтбор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПД."+СтруктураПоследовательности.стрОтборГраницы+" КАК  Реквизит
		|ИЗ
		|	Последовательность."+СтруктураПоследовательности.стрГраница+" КАК ПД
		|ГДЕ
		|	ПД.Период < &Дата";
		Запрос.УстановитьПараметр("Дата", Дата);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			МоментВремениДокумента = Новый МоментВремени(Дата);
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ПроведенВХронологическойПоследовательности",Ложь);

			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				СтруктураОтбора.Вставить(СтруктураПоследовательности.стрОтборГраницы,Выборка.Реквизит);
				Последовательности[СтруктураПоследовательности.стрГраница].УстановитьГраницу(МоментВремениДокумента,СтруктураОтбора);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры
